var data= [];
var dataStr ='1.蜘蛛侠<br>\
<br>\
导演：马克·韦布<br>\
编剧: 艾里克斯·库兹曼 / 罗伯托·奥奇 / 杰夫·皮克纳 / 詹姆斯·范德比尔特 / 斯坦·李 / 史蒂夫·迪特寇 /更多...<br>\
主演: 安德鲁·加菲尔德 / 艾玛·斯通 / 杰米·福克斯 / 戴恩·德哈恩 / 坎贝尔·斯科特 / 更多...<br>\
类型: 动作 / 科幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2014-05-04(中国大陆) / 2014-05-02(美国)<br>\
片长: 142分钟<br>\
<br>\
<br>\
2.老炮儿<br>\
<br>\
导演：管虎<br>\
编剧: 管虎 / 董润年<br>\
主演: 冯小刚 / 许晴 / 张涵予 / 刘桦 / 李易峰 / 更多...<br>\
类型: 剧情 / 动作 / 犯罪<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话<br>\
上映日期: 2015-12-24(中国大陆) / 2015-09-09(威尼斯电影节)<br>\
片长: 137分钟(中国大陆) / 140分钟(威尼斯电影节版)<br>\
<br>\
<br>\
3.西游记之孙悟空三打白骨精<br>\
<br>\
导演: 郑保瑞<br>\
编剧: 冉平 / 冉甲男 / 文宁<br>\
主演: 郭富城 / 巩俐 / 冯绍峰 / 小沈阳 / 罗仲谦 / 更多...<br>\
类型: 喜剧 / 动作 / 奇幻<br>\
制片国家/地区: 中国大陆 / 香港<br>\
语言: 汉语普通话<br>\
上映日期: 2016-02-08(中国大陆)<br>\
片长: 120分钟<br>\
<br>\
<br>\
4.澳门风云3 賭城風雲III <br>\
<br>\
导演: 刘伟强 / 王晶<br>\
编剧: 王晶<br>\
主演: 周润发 / 刘德华 / 张家辉 / 张学友 / 余文乐 / 更多...<br>\
类型: 喜剧 / 动作<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话 / 粤语<br>\
上映日期: 2016-02-08(中国大陆) / 2016-02-06(香港)<br>\
片长: 112分钟<br>\
<br>\
<br>\
5.他是龙<br>\
<br>\
导演: 英达尔·珍杜巴耶夫<br>\
编剧: 阿列克谢·阿尔谢尼耶夫 / 玛丽娜·季亚琴科 / 谢尔盖·季亚琴科 / 英达尔·珍杜巴耶夫<br>\
主演: 马特维·雷科夫 / 玛丽娅·波耶扎耶娃 / 彼得·罗曼诺夫 / 列娃·安德烈瓦伊达 / 阿莲娜·契诃娃 / 更多..<br>\
类型: 爱情 / 奇幻 / 冒险<br>\
制片国家/地区: 俄罗斯<br>\
语言: 俄语<br>\
上映日期: 2015-12-03(俄罗斯)<br>\
片长: 107分钟<br>\
<br>\
<br>\
6.房间 Room<br>\
<br>\
导演: 伦尼·阿伯拉罕森<br>\
编剧: 艾玛·多诺霍<br>\
主演: 布丽·拉尔森 / 雅各布·特伦布莱 / 琼·艾伦 / 肖恩·布里吉格斯 / 威廉姆·H·梅西 / 更多...<br>\
类型: 剧情 / 家庭<br>\
制片国家/地区: 爱尔兰 / 加拿大<br>\
语言: 英语<br>\
上映日期: 2015-09-15(多伦多国际电影节) / 2016-01-15(爱尔兰)<br>\
片长: 118分钟<br>\
<br>\
<br>\
7.天空の蜂<br>\
<br>\
导演: 堤幸彦<br>\
编剧: 楠野一郎 / 東野圭吾(原作)<br>\
主演: 江口洋介 / 本木雅弘 / 仲间由纪惠 / 绫野刚 / 柄本明 / 更多...<br>\
类型: 惊悚<br>\
制片国家/地区: 日本<br>\
语言: 日语<br>\
上映日期: 2015-09-12(日本)<br>\
片长: 138分钟<br>\
<br>\
<br>\
8.记住 Remember<br>\
<br>\
导演: 阿托姆·伊戈扬<br>\
编剧: Benjamin August<br>\
主演: 克里斯托弗·普卢默 / 迪恩·诺里斯 / 马丁·兰道 / 布鲁诺·甘茨 / 尤尔根·普洛斯诺 / 更多...<br>\
类型: 剧情 / 惊悚<br>\
制片国家/地区: 加拿大 / 德国<br>\
语言: 英语 / 德语<br>\
上映日期: 2015-10-23(加拿大) / 2015-12-31(德国)<br>\
片长: 95分钟<br>\
<br>\
<br>\
9.下流祖父 Dirty Grandpa<br>\
<br>\
导演: 丹·马泽<br>\
编剧: 约翰·菲利普斯<br>\
主演: 罗伯特·德尼罗 / 扎克·埃夫隆 / 奥布瑞·普拉扎 / 佐伊·达奇 / 朱莉安·浩夫 / 更多...<br>\
类型: 喜剧<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-01-22(美国)<br>\
片长: 102分钟<br>\
<br>\
<br>\
10.战争 Krigen<br>\
<br>\
导演: 托比亚斯·林道赫姆<br>\
编剧: 托比亚斯·林道赫姆<br>\
主演: 皮鲁·埃斯贝克 / 图娃·诺沃妮 / 达尔·萨利姆 / 索伦·莫灵 / 夏洛特·蒙克 / 更多...<br>\
类型: 剧情 / 战争<br>\
制片国家/地区: 丹麦<br>\
语言: 丹麦语<br>\
上映日期: 2015-09-10(丹麦)<br>\
片长: 115分钟<br>\
';


	var d = dataStr.split('<br><br><br>');
	for(var i =0; i <d.length; i++){
		var c = d[i].split('<br><br>');
		data.push({
			img:'img'+c[0].split('.')[0]+'.jpg',
			caption:c[0].split('.')[1],
			desc:c[1]
		});
		console.log(c[0].replace('.',' ')+'.jpg');
	}


